.. _cn_userguide:

CN Strings
============

Introduction
------------

The function :func:`clean_jp_cn() <dataprep.clean.clean_jp_cn.clean_jp_cn>` cleans a column containing Japanese Corporate Number (CN) strings, and standardizes them in a given format. The function :func:`validate_jp_cn() <dataprep.clean.clean_jp_cn.validate_jp_cn>` validates either a single CN strings, a column of CN strings or a DataFrame of CN strings, returning `True` if the value is valid, and `False` otherwise.

CN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "5835678256246"
* `standard`: CN strings with proper whitespace in the proper places, like "5-8356-7825-6246"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_jp_cn()` and `validate_jp_cn()`.

### An example dataset containing CN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "cn": [
            "5835678256246",
            "2-8356-7825-6246",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                 cn                                           address
0     5835678256246                                     123 Pine Ave.
1  2-8356-7825-6246                                           main st
2       51824753556                      1234 west main heights 57033
3    51 824 753 556                    apt 1 789 s maple rd manhattan
4             hello                robie house, 789 north main street
5               NaN  (staples center) 1111 S Figueroa St, Los Angeles
6              NULL                                             hello

## 1. Default `clean_jp_cn`

By default, `clean_jp_cn` will clean cn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_jp_cn
clean_jp_cn(df, column = "cn")

,cn,address,cn_clean
0,5835678256246,123 Pine Ave.,5-8356-7825-6246
1,2-8356-7825-6246,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_jp_cn(df, column = "cn", output_format="standard")

,cn,address,cn_clean
0,5835678256246,123 Pine Ave.,5-8356-7825-6246
1,2-8356-7825-6246,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_jp_cn(df, column = "cn", output_format="compact")

,cn,address,cn_clean
0,5835678256246,123 Pine Ave.,5835678256246
1,2-8356-7825-6246,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned CN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_jp_cn(df, column="cn", inplace=True)

           cn_clean                                           address
0  5-8356-7825-6246                                     123 Pine Ave.
1               NaN                                           main st
2               NaN                      1234 west main heights 57033
3               NaN                    apt 1 789 s maple rd manhattan
4               NaN                robie house, 789 north main street
5               NaN  (staples center) 1111 S Figueroa St, Los Angeles
6               NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_jp_cn(df, "cn", errors="coerce")

,cn,address,cn_clean
0,5835678256246,123 Pine Ave.,5-8356-7825-6246
1,2-8356-7825-6246,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_jp_cn(df, "cn", errors="ignore")

,cn,address,cn_clean
0,5835678256246,123 Pine Ave.,5-8356-7825-6246
1,2-8356-7825-6246,main st,2-8356-7825-6246
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_jp_cn()`

`validate_jp_cn()` returns `True` when the input is a valid CN. Otherwise it returns `False`.

The input of `validate_jp_cn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_jp_cn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_jp_cn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_jp_cn
print(validate_jp_cn("5835678256246"))
print(validate_jp_cn("2-8356-7825-6246"))
print(validate_jp_cn("51824753556"))
print(validate_jp_cn("51 824 753 556"))
print(validate_jp_cn("hello"))
print(validate_jp_cn(np.nan))
print(validate_jp_cn("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_jp_cn(df["cn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: cn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_jp_cn(df, column="cn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: cn, dtype: bool

### Only DataFrame

In [11]:
validate_jp_cn(df)

      cn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False